{
    "library": {
        "type" : "category-description",
        "id": "library",
        "name": "Library",
        "strategy": "library",
        "image": "/images/logo-lib.png",
        "why": "To ensure <strong>rigor</strong> in your design explore what is already done. Watch what competitors are doing or get an <strong>overview</strong> of existing guidelines, patterns and theories. Sometimes called deskresearch.",
        "motto": "Standing on the shoulders of giants."
    },
    "literature-study": {
        "type" : "card",
        "id": "literature-study",
        "name": "Literature Study",
        "strategy": "library",
        "image": "/images/lib-literature-study.png",
        "why": "Find contextual information, guidance and best practices. ",
        "how": "Make a ‘search plan’; identify relevant keywords. Find and judge your sources. Be sure to determine the relevance and reliability of a source by examining the publication date, the author’s background and whether the author has a commercial interest. Look at the sources of the book or article you found. Within the selected sources, trace references that are interesting, and repeat the search process with keywords you found in the selected texts.",
        "ingredients": [
"A willingness to read.",
"Your local library, a database, Google scholar, Google books or another search engine.",
"An ability to select what is really important for your case; and to leave the rest unread.",
"Identify the 'gatekeepers'.",
"Knowing ‘when to stop’."
],
        "in_practice": "A company focusing on UX in the medical domain applies a literature study to identify best practices when informing patients about health issues. ",
        "sliders": {
            "inspiration_data": 50,
            "rigor_relevance": 4,
            "overview_certainty": 25
        }
    },
    "trend-analysis": {
        "type" : "card",
        "id": "trend-analysis",
        "name": "Trend analysis",
        "strategy": "library",
        "image": "/images/lib-trend-analysis.png",
        "why": "Catch up with novel developments before your competitors do. ",
        "how": "You can make use of reports of trend watchers who summarize major trends in almost any area. Some trends may be short term (a hype), while others are much more stable over time. Make sense of trends based on their underlying data, for example: consumer behaviour, demographics, technological developments. Relate these trends to your own design challenge. ",
        "ingredients": [
"Understanding &amp; bookmarking Gartner’s hype-cycle.",
"Making Kickstarter your homepage.",
"A sense of how things change over time, depending on their underlying causes.",
"An ability to separate hypes from structural changes."
],
        "in_practice": "A trend analysis is oftentimes used to convince clients of the novelty and timeliness of a design. Some companies employ trend spotters who get time to bring in new developments as a form of strategic company planning. ",
        "sliders": {
            "inspiration_data": 25,
            "rigor_relevance": 5,
            "overview_certainty": 25
        }
    },

    "competitive-analysis": {
        "type" : "card",
        "id": "competitive-analysis",
        "name": "Competitive Analysis",
        "strategy": "library",
        "image": "/images/lib-competitive-analysis.png",
        "why": "Find a niche or unique selling point competitors are not filling. ",
        "how": "Identify the most important competitors and list their offerings. See which of the user needs are unaddressed by the competition. If you can deliver this, you have found your niche. ",
        "ingredients": [
"A willingness to offer something unique.",
"A good idea about who the competition is (also outside your domain).",
"A good idea of what your users want above the competitors’ offerings."
],
        "in_practice": "A competitive analysis is part of many new product offerings. Large-scale competitive analyses often include a field study as well, to identify user needs.",
        "sliders": {
            "inspiration_data": 50,
            "rigor_relevance": 25,
            "overview_certainty": 25
        }
    },

    "design-pattern-search": {
        "type" : "card",
        "id": "design-pattern-search",
        "name": "Design Pattern Search",
        "strategy": "library",
        "image": "/images/lib-design-pattern-search.png",
        "why": "Find common solutions for recurring problems and a description of the context in which these solutions work best.",
        "how": "Pattern collections are found in online repositories and books focusing on certain topics (such as designing for mobile, or designing for the social web). Look for details about the context in which a pattern works best. Even when you intent to break the pattern, make sure you know what it is and what tensions it resolves for the user.",
        "ingredients": [
"A suitable pattern collection.",
"A sensibility to follow good practice when appropriate.",
"Creativity to innovate within the constraints set in the pattern."
],
        "in_practice": "Many designers use patterns implicitly, they adapt and ‘remix’ what they know intuitively to work well. Pattern languages explicate these intuitions into design patterns that in turn allow designers to expand their intuitions.",
        "sliders": {
            "inspiration_data": 50,
            "rigor_relevance": 5,
            "overview_certainty": 50
        }
    },

    "orienting-expert-interview": {
        "type" : "card",
        "id": "orienting-expert-interview",
        "name": "Orienting Expert Interview",
        "strategy": "library",
        "image": "/images/lib-orienting-expert-interview.png",
        "why": "A domain or content expert can put you on track when you enter a new domain or field of expertise. The expert can point out sources, give you a sense of direction or point to common pitfalls. ",
        "how": "Trace an expert that is willing to talk to you about the problem and arrange an interview with this expert.",
        "ingredients": [
"An expert about your problem, or solution domain.",
"A healthy sense of realism about what experts can and cannot offer.",
"The right questions to ask.",
"Interviewing techniques."
],
        "in_practice": "Expert interviews are a common method to get a grip on a new problem area such as health or dementia. Or when you are about to do a design project and don’t have much experience yourself, you can interview a senior designer in the early stages of your project.",
        "sliders": {
            "inspiration_data": 25,
            "rigor_relevance": 5,
            "overview_certainty": 5
        }
    },

    "best-good-and-bad-practices": {
        "type" : "card",
        "id": "best-good-and-bad-practices",
        "name": "Best, good &amp; bad practices",
        "strategy": "library",
        "image": "/images/lib-best-good-and-bad-practices.png",
        "why": "Why invent the wheel again? Incorporating what others have learned is an important practice.",
        "how": "Depending on your topic many best, good and bad practices may be available.",
        "ingredients": [
"A willingness to investigate what others have done.",
"A sense of scope: which reported practices are important to you, which are not.",
"A critical sense of success factors: do the ones identified by others really apply to you? "
],
        "in_practice": "Internally good practices tend to be repeated, but few companies have processes to identify and incorporate best practices described by others. There is a real opportunity to improve here.",
        "sliders": {
            "inspiration_data": 75,
            "rigor_relevance": 25,
            "overview_certainty": 25
        }
    },

    "benchmark-creation": {
        "type" : "card",
        "id": "benchmark-creation",
        "name": "Benchmark creation",
        "strategy": "library",
        "image": "/images/lib-benchmark-creation.png",
        "why": "Existing products in your niche can be a valuable reference and source of inspiration.",
        "how": "Scout for products that are somehow related to your design goal. These could be products that solve the same problem or adopt a similar solution strategy. Create a structured overview of these products for example by clustering them into meaningful categories; creating a landscape of alternatives. Benchmarking may serve as a more extensive and neutral alternative to competitive analysis.",
        "ingredients": [
"A collector’s attitude.",
"An ability to focus out of your niche.",
"The patience to create multiple clusters and give meaning to them."
],
        "in_practice": "When designing an app that gives users personalised advice about new music artists, a benchmark shows information from similar websites or apps. The benchmark also compares solutions that give personalised advice about other topics, like books or travelling for example that could be inspiring.",
        "sliders": {
            "inspiration_data": 25,
            "rigor_relevance": 25,
            "overview_certainty": 5
        }
    },
    
    "field": {
        "type" : "category-description",
        "id": "field",
        "name": "Field",
        "strategy": "field",
        "image": "/images/logo-field.png",
        "why": "Explore the application context. You apply a field strategy to get an <strong>overview</strong> of your users, know their needs, desires and limitations so your design is <strong>relevant</strong> to them.",
        "motto": "Understand your users."
    },

    "interview": {
        "type" : "card",
        "id": "interview",
        "name": "Interview",
        "strategy": "field",
        "image": "/images/field-interview.png",
        "why": "It is hard to design for users you do not fully understand. Interviews allow you to understand users better by gathering their opinions, behaviours, goals, attitudes and experiences.",
        "how": "Invite representative participants, make them feel comfortable and ask questions about your topic of interest, for example product usage.",
        "ingredients": [
"Typically 5 to 10 users.",
"An interview guide with topics or questions.",
"Active listening skills.",
"Be able to improvise and ask ‘why’ a lot."
],
        "in_practice": "Interviews are widely used throughout design projects, but most often in the early stages of design.",
        "sliders": {
            "inspiration_data": 50,
            "rigor_relevance": 75,
            "overview_certainty": 25
        }
    },

    "survey": {
        "type" : "card",
        "id": "survey",
        "name": "Survey",
        "strategy": "field",
        "image": "/images/field-survey.png",
        "why": "Collect, mostly quantitative, information from a large sample of your target group.",
        "how": "A questionnaire is developed and handed to a representative sample of participants through the right channels. A variety of online tools can be used to analyse the responses.",
        "ingredients": [
"A large and representative group of users.",
"A survey instrument or tool.",
"Be able to phrase questions that are suitable in a survey.",
"Someone to proofread or test your questionnaire."
],
        "in_practice": "Surveys are widely used in marketing and sometimes in the early stages of design. This method is quick and inexpensive, however it can be difficult to obtain reliable results.",
        "sliders": {
            "inspiration_data": 95,
            "rigor_relevance": 75,
            "overview_certainty": 50
        }
    },

    "fly-on-the-wall": {
        "type" : "card",
        "id": "fly-on-the-wall",
        "name": "Fly on the wall",
        "strategy": "field",
        "image": "/images/field-fly-on-the-wall.png",
        "why": "Find out how people act in real life by using a non-obtrusive observation technique.",
        "how": "Try to watch people without talking with them. While observing, make notes of peoples activities, interactions and environments.",
        "ingredients": [
"A spot where you can see the users without being noticed.",
"A note taking form that will give structure to your observations and allow you to code and count behaviour easily.",
"Sketches of the environment in which the behaviour takes place.",
"A willingness to stick to the facts and delay interpretation. "
],
        "in_practice": "Fly on the wall observation is a very useful method for situations in which people act different than they say they do, or when the presence of a researcher might cause them to act in awkward ways. A special form of fly on the wall is 'day in the life' in which users are shadowed during a full, regular day.",
        "sliders": {
            "inspiration_data": 25,
            "rigor_relevance": 95,
            "overview_certainty": 5
        }
    },

    "cultural-probes": {
        "type" : "card",
        "id": "cultural-probes",
        "name": "Cultural probes",
        "strategy": "field",
        "image": "/images/field-cultural-probes.png",
        "why": "Probes can be used to gather inspirational rather than factual information from users. They give insights in peoples lives, values and thoughts.",
        "how": "Assemble a cultural probes kit and distribute it to the users. The kit can contain activities, questions and/or assignments that give you insight and inspiration on the topic you are interested in. After a period of time, collect the results and discuss them together with the user.",
        "ingredients": [
"A prepared cultural probes kit (e.g. camera, diary, instructions, coloured pens, stickers, exercises, etc.).",
"A small group of users who are willing and able to spend the time and creativity to do the activities over a period of time.",
"Assignments, questions and exercises that are fun for the participants to do.",
"A willingness to remind users regularly about their assignments so they also return the kit."
],
        "in_practice": "Cultural probes can be inspirational and give a great insight in peoples lives. They are particularly useful in open-ended design projects or projects covering sensitive topics.",
        "sliders": {
            "inspiration_data": 5,
            "rigor_relevance": 75,
            "overview_certainty": 5
        }
    },

    "participant-observation": {
        "type" : "card",
        "id": "participant-observation",
        "name": "Participant observation",
        "strategy": "field",
        "image": "/images/field-participant-observation.png",
        "why": "Sometimes the best design ideas arise from ‘first hand’ experience with the situation you are designing for; so “be the user”.",
        "how": "You immerse yourself into a group you are interested in and participate in their activities as any member of that group. This way you gain empathy and notice things that group members take for granted.",
        "ingredients": [
"Speak the language of the participants and learn the habits of the group.",
"Respectful and meaningful relationships with the users.",
"A good eye (and a notebook, video registration?) for non-verbal communication between participants.",
"The possibility to make detailed notes without affecting others."
],
        "in_practice": "In a project for schoolchildren designers decided to sit in the classroom, take part in the games during breaks and have lunch together, in order to get to know their world and activities.",
        "sliders": {
            "inspiration_data": 25,
            "rigor_relevance": 75,
            "overview_certainty": 25
        }
    },

    "diary-study": {
        "type" : "card",
        "id": "diary-study",
        "name": "Diary study",
        "strategy": "field",
        "image": "/images/field-diary-study.png",
        "why": "Report detailed information about routines and long-term experience.",
        "how": "Ask users to keep a diary over a period of time and report about their personal experience regarding your topic of interest. It’s possible to ask users to report about activities, feelings or frustrations.",
        "ingredients": [
"A representative small group of participant (5-10).",
"A well prepared diary with daily reporting exercises and instructions for a description about how participants on how they should need to report about the tasks.",
"The report can be a mix of writings, photos, videos and/or audio recordings."
],
        "in_practice": "In one diary study users were asked to review some kind of app or device to see how it fitted their habits. Diary studies are also useful for insights in the user experience of services that take multiple days or weeks to complete, like planning and booking a holiday.",
        "sliders": {
            "inspiration_data": 50,
            "rigor_relevance": 95,
            "overview_certainty": 5
        }
    },

    "focus-group": {
        "type" : "card",
        "id": "focus-group",
        "name": "Focus group",
        "strategy": "field",
        "image": "/images/field-focus-group.png",
        "why": "When the topic asks for it, or for efficiency reasons, opinions and experiences can also be gathered through group discussions called focus groups.",
        "how": "A group of five to ten people is invited for a 45 to 90 minutes discussion, which could be centred around a question, topic or a prototype.",
        "ingredients": [
"A focus group plan with detailed time schedule, questions and topics.",
"Video recording equipment to film and later analyse the results.",
"Drinks and snacks for your participants.",
"Group management skills. Making people feel comfortable, reminding them regularly that everyone’s opinion matters, ensuring and managing diversity of participants and so on."
],
        "in_practice": "Focus groups are a popular technique in marketing and for the front-end of design when it is still unclear what the requirements for a product are.",
        "sliders": {
            "inspiration_data": 25,
            "rigor_relevance": 75,
            "overview_certainty": 25
        }
    },

    "context-mapping": {
        "type" : "card",
        "id": "context-mapping",
        "name": "Context mapping",
        "strategy": "field",
        "image": "/images/field-context-mapping.png",
        "why": "Get an understanding of the context and personal experience of users with a product or service.",
        "how": "Users actively participate in the design process from the early stages of design together with designers and stakeholders. A number of exercises allow users to relate to the topic through making things, doing things and talking about it.",
        "ingredients": [
"A pre-determined topic and an activity plan.",
"Warm up exercises for the users (for example cultural probes) to do at home.",
"An open mind and an ability to stimulate users to share and be creative.",
"Video recording equipment and note taking materials to support analysis after the session."
],
        "in_practice": "Context mapping is particularly useful at the start of a very open-ended design project.",
        "sliders": {
            "inspiration_data": 25,
            "rigor_relevance": 95,
            "overview_certainty": 5
        }
    },

    "card-sorting": {
        "type" : "card",
        "id": "card-sorting",
        "name": "Card sorting",
        "strategy": "field",
        "image": "/images/field-card-sorting.png",
        "why": "Find out what information organisation structures are considered intuitive by users.",
        "how": "Make labels for the main bits of information on your website. Invite users to the workplace and have them organise the labels in a way they find appropriate and have them explain why. Make sure you understand the underlying reasons for their choice.",
        "ingredients": [
"A small group of representative users.",
"Cards with information that appears on your website.",
"Video or photo equipment to record the results.",
"A willingness to remind users to think out loud or to ask many questions about the reasons users have for a certain structure."
],
        "in_practice": "Card sorting is used regularly to decide on the information architecture of big websites or apps.",
        "sliders": {
            "inspiration_data": 50,
            "rigor_relevance": 75,
            "overview_certainty": 50
        }
    },

    "day-in-the-life": {
        "type" : "card",
        "id": "day-in-the-life",
        "name": "Day in the life",
        "strategy": "field",
        "image": "/images/field-day-in-the-life.png",
        "why": "Gain insights in the life of your users. To gain empathy, a day in the life could be a useful technique.",
        "how": "Follow a user throughout a typical day and map his/her activities and interactions.",
        "ingredients": [
"Several users who are willing to be shadowed for a day.",
"Note taking materials.",
"Time to do ‘the day in the life’ and to analyse the notes.",
"A way to figure out what a ‘typical’ day is."
],
        "in_practice": "A day in the life is particularly valuable in the beginning of an open-ended design project.",
        "sliders": {
            "inspiration_data": 25,
            "rigor_relevance": 95,
            "overview_certainty": 5
        }
    },

    "bag-tour": {
        "type" : "card",
        "id": "bag-tour",
        "name": "Bag tour",
        "strategy": "field",
        "image": "/images/field-bag-tour.png",
        "why": "As a low threshold introduction to the user, which still gives valuable insights, the bag tour asks users to report about themselves based on the content of their bag.",
        "how": "Ask people to show the content of their bags and let them talk about these objects. The objects reveal a lot of information about someone’s personality, interests and values. You can make notes and pictures of the objects for analysis.",
        "ingredients": [
"Users who feel comfortable enough to share the contents of their bags with you.",
"Note-taking equipment (and possibly video equipment).",
"Conversation skills and a sense of humour."
],
        "in_practice": "The bag tour is also used in other variants such as key chains, desks or suitcases.",
        "sliders": {
            "inspiration_data": 5,
            "rigor_relevance": 95,
            "overview_certainty": 5
        }
    },

    "lab": {
        "type" : "category-description",
        "id": "lab",
        "name": "Lab",
        "strategy": "lab",
        "image": "/images/logo-lab.png",
        "why": "Be <strong>certain</strong> your solution works and is <strong>relevant</strong> for the end-user. Will your design work out the way you intended it to?",
        "motto": "To measure is to know."
    },

    "usability-testing": {
        "type" : "card",
        "id": "usability-testing",
        "name": "Usability Testing",
        "strategy": "lab",
        "image": "/images/lab-usability-testing.png",
        "why": "Detect problems users have with your design and correct these before the product goes live. ",
        "how": "It is impossible to get the design right in one go, no matter how much experience you have. Ask a small group of users to perform tasks with a (paper) prototype of your solution. Typically users are asked to think aloud so you can grasp what the user is thinking. In a formative user test the goal is to detect as many problems as possible users are encountering using the site. In a summative user test user behaviour is tested against pre-set goals.",
        "ingredients": [
"A (paper) prototype.",
"A quiet room with the user or a usability lab.",
"Recording equipment."
],
        "in_practice": "Usability testing is common practice in many design firms, although sometimes placeholders are used rather than ‘real’ end-users. ",
        "sliders": {
            "inspiration_data": 75,
            "rigor_relevance": 95,
            "overview_certainty": 75
        }
    },

    "a-b-testing": {
        "type" : "card",
        "id": "a-b-testing",
        "name": "A/B Testing",
        "strategy": "lab",
        "image": "/images/lab-AB-testing.png",
        "why": "A minor change in a design may alter user behaviour in ways that are hard to detect in a usability test. An A/B test allows you to compare real-world user behaviour across different versions of the product.",
        "how": "In an A/B test the user is confronted with one or two versions of an interactive product. Remote software records metrics for user behaviour. These metrics are compared between the two versions to see which alternative is better. Sometimes more than two alternatives are tested: A/B/X testing.",
        "ingredients": [
"Specialized software.",
"Reliable metrics.",
"A large amount of users. "
],
        "in_practice": "Google does a lot of A/B testing on its search services. The tiniest details can count for Google because they have so many users. Some companies also use the A/B experimental design for testing concepts, rather than finished products.",
        "sliders": {
            "inspiration_data": 95,
            "rigor_relevance": 75,
            "overview_certainty": 95
        }
    },

    "field-trial": {
        "type" : "card",
        "id": "field-trial",
        "name": "Field Trial",
        "strategy": "lab",
        "image": "/images/lab-field-trial.png",
        "why": "Participants never act completely naturally in a lab setting, so consider testing your product in the ‘wild’. This can be particularly valuable when real-life disturbances are important for your design, as is the case with mobile apps. ",
        "how": "Recruit users and ask them to use your device for a period of time. In a field trial, you cannot easily adapt, so preparation is key. Make sure your prototype is robust enough to be used in the field. Make a detailed list of evaluation questions and think about how and when you can measure them (logs, questionnaires, interviews). ",
        "ingredients": [
"A clear idea of what you want to learn from the test. ",
"A robust prototype.",
"An evaluation plan.",
"A user group willing to use your prototype (for a long period of time). "
],
        "in_practice": "Field trials are particularly suitable for mobile and social solutions that are hard to test in the lab. A particular kind of field trial is a beta-test, which is common practice in the game industry for example. ",
        "sliders": {
            "inspiration_data": 75,
            "rigor_relevance": 95,
            "overview_certainty": 75
        }
    },

    "wizard-of-oz": {
        "type" : "card",
        "id": "wizard-of-oz",
        "name": "Wizard of Oz",
        "strategy": "lab",
        "image": "/images/lab-wizard-of-oz.png",
        "why": "A Wizard of Oz: acting out the systems functionality, can help when a system has not been build yet, but a realistic user test is necessary to drive design. ",
        "how": "In a Wizard of Oz study the user is made to believe he works with the real system, while in practice someone ‘behind the screen’ controls the system behaviours. Sometimes temporary software is build to avoid the user detecting the simulation.",
        "ingredients": [
"Experimenters ought to have seen the movie...",
"A separate room for the “wizard” where he can control the system.",
"A believable story for the users."
],
        "in_practice": "The Wizard of Oz technique is popular in Service Design projects, although the requirement that the user should not know he is not using the real system is sometimes dropped. This brings the technique close to role-play though.",
        "sliders": {
            "inspiration_data": 75,
            "rigor_relevance": 50,
            "overview_certainty": 50
        }
    },

    "online-analytics": {
        "type" : "card",
        "id": "online-analytics",
        "name": "Online analytics",
        "strategy": "lab",
        "image": "/images/lab-web-analytics.png",
        "why": "Gain insights from real usage statistics in order to continue improving a website, app or social media campaign after it is in use, or monitor it’s use for marketing purposes. ",
        "how": "Analytics software can monitor user behaviour in terms of basic demographics (where do users come from) and onsite behaviour (duration of visits and clicks). By analysing these statistics you can identify weak points in the website, app or online marketing campaign or you can compare them to key performance indicators (KPI's). ",
        "ingredients": [
"Analytic software.",
"An analytic mind-set.",
"Knowledge about statistics and SEO.",
"Key performance indicators (KPI's)."
],
        "in_practice": "There are companies specializing in online analytics consultancy and search engine optimization. Many small companies do their own online analytics. ",
        "sliders": {
            "inspiration_data": 95,
            "rigor_relevance": 95,
            "overview_certainty": 95
        }
    },

    "think-aloud": {
        "type" : "card",
        "id": "think-aloud",
        "name": "Think aloud",
        "strategy": "lab",
        "image": "/images/lab-thinking-aloud.png",
        "why": "Understand the reasons behind user behaviour, or uncover the mental models of the user in a usability test.",
        "how": "Ask users to think aloud (say everything they are thinking) while performing a task in a usability test. As thinking aloud is quite unnatural, you remind users regularly to keep on voicing his/her thoughts. Since children are bad at voicing their thoughts, this technique can only be applied from the early teens on.",
        "ingredients": [
"Put the user at ease.",
"Remind the user regularly to think aloud.",
"A usability setup, including tasks."
],
        "in_practice": "Think aloud is standard practice in usability testing.",
        "sliders": {
            "inspiration_data": 50,
            "rigor_relevance": 75,
            "overview_certainty": 75
        }
    },

    "biometrics": {
        "type" : "card",
        "id": "biometrics",
        "name": "Biometrics",
        "strategy": "lab",
        "image": "/images/lab-biometrics.png",
        "why": "To get objective data about users' attention and physical state.",
        "how": "Using specialist hardware such as eye-tracking equipment, eye-tracking glasses or sensors to measure heartrate, skin conductivity or brain activity, can be used to collect objective measurements of users' engagement with a design.",
        "ingredients": [
"Specialised bio-metric equipment.",
"Access to a trained expert who can help you with setup and interpretation.",
"A sense of what can and cannot be concluded from biometric data.",
"A quantitative mind-set."
],
        "in_practice": "Eye-tracking is used in addition to standard usability testing to detect problems in the interface. These can be a starting point for interviews. Other biometric measures are used to measure player enjoyment in games or in simulators.",
        "sliders": {
            "inspiration_data": 5,
            "rigor_relevance": 75,
            "overview_certainty": 95
        }
    },

   "showroom": {
        "type" : "category-description",
        "id": "showroom",
        "name": "Showroom",
        "strategy": "showroom",
        "image": "/images/logo-show.png",
        "why": "Be <strong>certain</strong> your ideas are better than what is already done. Proof the <strong>rigor</strong> of your design by showing it to experts, test against guidelines or decide on its USPs.",
        "motto": "Know & show your contribution."
    },
    
    "peer-review": {
        "type" : "card",
        "id": "peer-review",
        "name": "Peer Review",
        "strategy": "showroom",
        "image": "/images/show-peer-review.png",
        "why": "“With many eye-balls on the code, all bugs are shallow.” Colleagues and experts can help position and improve your work, certainly if it needs to be reused by them.",
        "how": "Organize a group of representative experts and have them look at your work in a structured way. Peer reviews can have formal and less formal forms, but their quality depends on two factors: the right experts and the right instructions for looking at and reporting about your work.",
        "ingredients": [
"A bunch of colleagues or other (external) experts.",
"A reviewing procedure.",
"Reviewing and reporting guidelines.",
"Time to process the results."
],
        "in_practice": "Peer review is applied in many forms in practice, both formal and informal. Peer programming and heuristic evaluations are well known forms of peer review.",
        "sliders": {
            "inspiration_data": 50,
            "rigor_relevance": 25,
            "overview_certainty": 75
        }
    },

    "quality-review": {
        "type" : "card",
        "id": "quality-review",
        "name": "(Product) Quality Review",
        "strategy": "showroom",
        "image": "/images/show-quality-review.png",
        "why": "Ensure the product is perfect before it is released to the client or users.",
        "how": "A representative from the client and experts do a walk-through of the final product before it gets released to ensure the quality of the product meets pre-set standards.",
        "ingredients": [
"The client and/or other experts.",
"A couple of hours to do the walk-through.",
"Notepaper to write down the improvement points.",
"A list of standards or a set of requirements that the product should meet."
],
        "in_practice": "Product quality reviews are common practice in many design firms, and standardized in some agile methodologies.",
        "sliders": {
            "inspiration_data": 50,
            "rigor_relevance": 25,
            "overview_certainty": 75
        }
    },

    "heuristic-evaluation": {
        "type" : "card",
        "id": "heuristic-evaluation",
        "name": "Heuristic Evaluation",
        "strategy": "showroom",
        "image": "/images/show-heuristic-evaluation.png",
        "why": "Complementary to user research, or when user research is too costly, a heuristic evaluation can be used to detect and repair usability errors. ",
        "how": "Usability experts are given detailed instructions or tasks, a set of usability guidelines, and a reporting format. The experts analyse a product for violations of the guidelines and suggest improvements to the product.",
        "ingredients": [
"A group of usability experts.",
"Usability guidelines.",
"A reporting format.",
"A testable product or prototype."
],
        "in_practice": "Many product quality reviews are a lightweight form of heuristic evaluation. Working with explicit heuristics and standardized reporting forms however, can greatly improve this practice.",
        "sliders": {
            "inspiration_data": 75,
            "rigor_relevance": 25,
            "overview_certainty": 5
        }
    },

    "expo": {
        "type" : "card",
        "id": "expo",
        "name": "Expo",
        "strategy": "showroom",
        "image": "/images/show-expo.png",
        "why": "By placing your work in the spotlight, you learn about its value for others in ways you might not expect yourself.",
        "how": "Organize an exhibition, a portfolio site, a conference, or another way to exhibit your work to a wide range of potential experts. Make sure you collect lots of feedback, for example by organizing a contact moment with the experts for follow up.",
        "ingredients": [
"An exhibition space online or in the real world.",
"An engaging presentation of your work.",
"An audience.",
"Ways to collect feedback."
],
        "in_practice": "Exhibition as a method is practiced a lot in art and science; several conferences with a professional orientation exist such as UX-camp and The Web and Beyond Conference. An exposition of your showcase projects can be important for marketing but also for finding out opinions and unexpected new uses for the portfolio.",
        "sliders": {
            "inspiration_data": 5,
            "rigor_relevance": 25,
            "overview_certainty": 50
        }
    },

    "pitch": {
        "type" : "card",
        "id": "pitch",
        "name": "Pitch",
        "strategy": "showroom",
        "image": "/images/show-pitch.png",
        "why": "Get a grasp on your unique selling points and practice concise communication about them. ",
        "how": "Prepare a short presentation of maximum 1-3 minutes about your product or business proposition. Practice the pitch on a wide range of experts to collect feedback and improve it.",
        "ingredients": [
"Enthusiasm.",
"The ability to present your idea shortly and convincingly.",
"Representative experts.",
"A willingness to improve and change."
],
        "in_practice": "The ‘elevator pitch’ is used by almost all independent professionals to practice communicating their business proposition.",
        "sliders": {
            "inspiration_data": 25,
            "rigor_relevance": 50,
            "overview_certainty": 75
        }
    },

    "co-reflection": {
        "type" : "card",
        "id": "co-reflection",
        "name": "Co-reflection",
        "strategy": "showroom",
        "image": "/images/show-co-reflection.png",
        "why": "Involve stakeholders and other experts early in the design process in order to set an innovative direction and to create openness for novel ideas among stakeholders.",
        "how": "Set up a meeting with a diverse group of stakeholders in the design process and ask them to discuss your problem, the results of your user research, and early versions of your design or (provocative) prototypes. Jointly decide on design priorities and focus for the rest of your project.",
        "ingredients": [
"A representation of your insights and a solution.",
"A diverse and cooperative group of experts.",
"Facilitation skills.",
"A clear explanation of the proceedings of the process. "
],
        "in_practice": "Co-reflection is suitable for innovative projects and design research and is a standard element of the 1:10:100 method.",
        "sliders": {
            "inspiration_data": 25,
            "rigor_relevance": 25,
            "overview_certainty": 75
        }
    },

    "provocative-prototyping": {
        "type" : "card",
        "id": "provocative-prototyping",
        "name": "Provocative Prototyping",
        "strategy": "showroom",
        "image": "/images/show-provocative-prototyping.png",
        "why": "Friendly provocation can help uncover hidden values and requirements from your stakeholders.",
        "how": "Create a design idea that answers the design brief, but deliberately break or play with existing norms and beliefs about how things are done. Discuss the prototypes early in the design process with stakeholders. ",
        "ingredients": [
"A sensibility for hidden assumptions and a sense of humour.",
"A prototype that is certain to bring about a lot of discussion.",
"Facilitation skills."
],
        "in_practice": "Provocative prototyping, sometimes called provotyping, can be used in innovative trajectories with conservative partners; in particular if combined with co-reflection.",
        "sliders": {
            "inspiration_data": 5,
            "rigor_relevance": 25,
            "overview_certainty": 50
        }
    },

    "usp": {
        "type" : "card",
        "id": "usp",
        "name": "USP (Unique Selling Points)",
        "strategy": "showroom",
        "image": "/images/show-usp.png",
        "why": "In a competitive business situation you need to be able to identify and communicate clearly and concisely what it is that sets you apart.",
        "how": "Make a list of the envisioned benefits of your product and compare them systematically with the competition. ",
        "ingredients": [
"A sense about what makes you unique.",
"A disciplined and honest comparison with others. ",
"A background knowledge about who the competition may be. "
],
        "in_practice": "Unique selling points are featured in many product pitches. ",
        "sliders": {
            "inspiration_data": 75,
            "rigor_relevance": 25,
            "overview_certainty": 75
        }
    },

     "workshop": {
        "type" : "category-description",
        "id": "workshop",
        "name": "Workshop",
        "strategy": "workshop",
        "image": "/images/logo-work.png",
        "why": "Explore opportunities. Prototyping, sketching and co-creation activities are all ways to innovate and to gain insights in what is <strong>possible</strong> and how things could work.",
        "motto": "Seek variation and improvement!"
    },
 
    "ideation": {
        "type" : "card",
        "id": "ideation",
        "name": "Ideation",
        "strategy": "workshop",
        "image": "/images/work-ideation.png",
        "why": "Generate and develop new ideas.",
        "how": "Bring people together in a workshop in order to spark creativity and use a creative technique to help set a creative mind-set among the participants of the workshop. Many different creative techniques exist to help generate and develop new ideas. You can find these techniques in books and card sets about ideation, like the ones from Thinker Toys or IDEO.",
        "ingredients": [
"When done in a group, a shared problem statement and rules.",
"A specific ideation technique.",
"A willingness and ability to use intermediate ideas as stepping stone for new ones, even if they do not solve the problem.",
"Avoiding idea killers, like early criticism."
],
        "in_practice": "Ideation sessions, individual or in groups are part of most design processes. Examples of common techniques are: using analogies and metaphors to find inspiration, organizing a brainstorm, or using “how-to” questions to come up with ideas.",
        "sliders": {
            "inspiration_data": 5,
            "rigor_relevance": 50,
            "overview_certainty": 50
        }
    },

    "sketching": {
        "type" : "card",
        "id": "sketching",
        "name": "Sketching",
        "strategy": "workshop",
        "image": "/images/work-sketching.png",
        "why": "Explore and communicate forms and ideas.",
        "how": "Take a pen and a piece of paper, a notebook, or a digital tool and draw your ideas. When you visualize your ideas, you start to encounter design challenges that are a starting point for more research. The resulting sketches can be used to discuss and develop ideas together with colleagues and stakeholders.",
        "ingredients": [
"Hand drawing tools, analogue or digital: pen, pencil, paper.",
"A willingness to make many sketches and variants of an idea.",
"A good eye for new ideas that your sketch brings and a critical eye for what can be improved."
],
        "in_practice": "For many designers sketching is a continuous day-to-day activity. ",
        "sliders": {
            "inspiration_data": 25,
            "rigor_relevance": 50,
            "overview_certainty": 50
        }
    },

    "storytelling": {
        "type" : "card",
        "id": "storytelling",
        "name": "Storytelling ",
        "strategy": "workshop",
        "image": "/images/work-storytelling.png",
        "why": "Make abstract concepts concrete and strengthen the empathy for the user in your team by using storytelling.",
        "how": "Building on insights you gained in previous research, create user stories about the interaction with your envisioned product.",
        "ingredients": [
"An ability to strike a balance between drama and information.",
"A focus on the interaction and its benefits over side-tracks.",
"The skill to capture the essence of something in a concise and engaging story."
],
        "in_practice": "Stories can be essential in communicating a novel design idea, internally and externally. ",
        "sliders": {
            "inspiration_data": 25,
            "rigor_relevance": 50,
            "overview_certainty": 75
        }
    },

    "prototyping": {
        "type" : "card",
        "id": "prototyping",
        "name": "Prototyping",
        "strategy": "workshop",
        "image": "/images/work-prototyping.png",
        "why": "Develop, evaluate or communicate a concept or design. ",
        "how": "Start by determining one, or a few, conceptual, design or technical challenges you wish to tackle in the upcoming prototyping cycle. Determine which kind of prototype is suitable to evaluate the outcome (low-fidelity or high fidelity); for example: paper prototype, digital prototype, or video prototype. Create and evaluate the prototype.",
        "ingredients": [
"A mind-set that promotes ‘fail fast, fail often’.",
"A purposeful making attitude and prototyping skills.",
"The ability to ‘kill your darlings’ if the feedback is negative.",
"Prototyping materials or tools (paper, video, prototyping languages or toolsets)."
],
        "in_practice": "Sometimes it is a bit fuzzy when sketching ends and prototyping starts. Sketching focuses on exploration and prototyping focuses on design challenges and evaluating your outcome.",
        "sliders": {
            "inspiration_data": 50,
            "rigor_relevance": 50,
            "overview_certainty": 75
        }
    },

    "morphological-chart": {
        "type" : "card",
        "id": "morphological-chart",
        "name": "Morphological chart",
        "strategy": "workshop",
        "image": "/images/work-morphological-chart.png",
        "why": "Generating ideas in a systematic manner.",
        "how": "Draw a chart that lists all the functions of your product and sketch all the possible solutions per function.",
        "ingredients": [
"Ability to dream up many variants of a solution.",
"A systematic way of working.",
"A large sheet of paper and hand drawing tools.",
"An analysis of the parts or functions of your design."
],
        "in_practice": "Morphological charts are used in product design and are particularly useful to come up with unexpected alternatives for complex designs. Their origin lies in the field of industrial product design.",
        "sliders": {
            "inspiration_data": 50,
            "rigor_relevance": 50,
            "overview_certainty": 50
        }
    },

    "co-creation": {
        "type" : "card",
        "id": "co-creation",
        "name": "Co-creation",
        "strategy": "workshop",
        "image": "/images/work-co-creation.png",
        "why": "Gain inspiration from your users by involving them in the design process. It may lead to unexpected and sensible project outcomes.",
        "how": "Organise creative workshops with end users or offer design tools allowing customers to create their own product. Consider adding a contest element in order to motivate participants.",
        "ingredients": [
"A group of users who are willing to be involved in the design in a creative way.",
"Moderation skills to ensure and manage diversity and facilitate and encourage user creativity.",
"An ability to come up with creative exercises and design games to allow the user to bring his experience to the table."
],
        "in_practice": "Co-creation sessions are a default part of a context mapping exercise. Several companies have used co-creation in the marketplace by, for example, asking users to describe a recipe for a new flavour of potato chips or to design a sneaker.",
        "sliders": {
            "inspiration_data": 25,
            "rigor_relevance": 75,
            "overview_certainty": 50
        }
    },

    "proof-of-concept": {
        "type" : "card",
        "id": "proof-of-concept",
        "name": "Proof of Concept",
        "strategy": "workshop",
        "image": "/images/work-poc.png",
        "why": "Demonstrate the desirability or the feasibility of your idea or design. ",
        "how": "Create a prototype or demonstration of a single critical aspect of your idea to test if it really offers a good solution to the problem you are solving. You can take different aspects into account, like effectiveness, efficiency, user experience, technical limitations or interaction within the context of the user.",
        "ingredients": [
"A willingness to tackle the most risky/difficult parts first.",
"Prototyping materials and tools to realize or simulate the idea.",
"Knowing what is important to test and/or communicate the idea and what aspects are superfluous."
],
        "in_practice": "In the design of an app that is supposed to be used outside, a proof of concept demo might for example test what happens when it rains or the user’s fingers are cold.",
        "sliders": {
            "inspiration_data": 75,
            "rigor_relevance": 50,
            "overview_certainty": 75
        }
    },

    "scamper": {
        "type" : "card",
        "id": "scamper",
        "name": "Scamper",
        "strategy": "workshop",
        "image": "/images/work-scamper.png",
        "why": "When it is hard to develop an initial idea into an elegant solution, a morphological technique such as scamper can help.",
        "how": "Scamper is an acronym you can use to create variants of your ideas by Selecting, Combining, Adapting, Modifying, Put to different uses, Eliminating and Reversing. Then iterate; so apply these transformations to the variants you created as well.",
        "ingredients": [
"Pen and paper.",
"A willingness to create and evaluate many variants of your initial idea.",
"The Thinker toy’s scamper card set can be helpful."
],
        "in_practice": "Scamper is particularly useful when you try to design the functionality and interaction of a product.",
        "sliders": {
            "inspiration_data": 75,
            "rigor_relevance": 50,
            "overview_certainty": 50
        }
    },

    "stepping-stone": {
        "type" : "category-description",
        "id": "stepping-stone",
        "name": "Stepping Stones",
        "strategy": "stepping-stone",
        "image": "/images/logo-step.png",
        "why": "Condense your insights into <strong>tangible</strong> representations that can be re-used in the rest of the project and help to communicate findings to the team and client.",
        "motto": "Condense, communicate, combine."
    },
 
    "design-specification": {
        "type" : "card",
        "id": "design-specification",
        "name": "Design Specification",
        "strategy": "stepping-stone",
        "image": "/images/step-design-specification.png",
        "why": "Describe the characteristics of a product, like a website or an application, in order to inform the designers and developers who are involved.",
        "how": "The design specification contains models of the product and some argumentation for the design choices that have been made. A design specification can consist of user stories, wireframes, flow charts, wireflows, sitemaps, style guides, mock-ups or screen designs, etc. As the number of people involved in the design and development process increases, these documents become more important in order to keep everybody informed about design choices.",
        "ingredients": [
"Design/prototyping tools such as Adobe tools, Invision, Balsamiq, Sketch.",
"The ability to model and visualize the design in a way that it is clear to all stakeholders.",
"The ability to choose appropriate modelling techniques."
],
        "in_practice": "Design specifications are ubiquitous in design practice, although the tools used, differ greatly from company to company and project to project. In an agile project though, it is common practice to minimize the amount of design specifications."

    },

    "mood-board": {
        "type" : "card",
        "id": "mood-board",
        "name": "Mood Board",
        "strategy": "stepping-stone",
        "image": "/images/step-moodboard.png",
        "why": "Before you start to make a design, a mood board can help describe the ‘mood’ or the ‘feel’ of the envisioned product.",
        "how": "Make a physical or digital collage of images, typography and a colour scheme to describe 'fluffy' stuff such as the ‘mood’, ‘feel’, or other core design concepts you want your product to have. The images are often gathered from magazines or visual discovery tools like Pinterest.",
        "ingredients": [
"Paper, magazines, glue or digital equivalents.",
"A willingness to work intuitively, to collect and decide.",
"A sense of beauty and emotion."
],
        "in_practice": "Mood boards are an essential part of many aesthetic design projects, in particular for communication across stakeholders."
    },

    "scenario": {
        "type" : "card",
        "id": "scenario",
        "name": "Scenario",
        "strategy": "stepping-stone",
        "image": "/images/step-scenario.png",
        "why": "Different types of scenarios exist that each serves a different purpose, for example to develop user requirements, to generate ideas or to reflect on a concept.",
        "how": "Create narrative or visual stories to illustrate interactions in a specific situation. Depending on your aim you can create the appropriate scenario; for example: context scenario to develop a user requirements list, key path scenario to get an idea for the interaction, validation scenario to test your design idea, etc.",
        "ingredients": [
"A basic understanding of the users and the interactions within the intended context of use.",
"A clear idea about what you want to achieve with your scenario.",
"A model of your user(s)."
],
        "in_practice": "Scenarios are a versatile and quick way to develop, test and plan your design ideas."
    },

    "empathy-map": {
        "type" : "card",
        "id": "empathy-map",
        "name": "Empathy Map",
        "strategy": "stepping-stone",
        "image": "/images/step-empathy-map.png",
        "why": "Summarize and synthetize findings from observations and interviews in a structured way. Empathy maps can offer valuable and unexpected insights in the user.",
        "how": "Write down your insights and inferred conclusions about your user on a sheet of paper. Try to describe a typical user, by describing what users say, do, hear, think and feel. Often goals and attitudes (pains &amp; gains) are also included to create a richer description.",
        "ingredients": [
"A large sheet of paper with an empty empathy map template.",
"Insights and empathy gained from previous user research.",
"A feel for the details that characterize the user."
],
        "in_practice": "Empathy maps can be particularly useful in projects in which the user is very different from the designer in many respects; social design projects for example."
    },

    "persona": {
        "type" : "card",
        "id": "persona",
        "name": "Persona",
        "strategy": "stepping-stone",
        "image": "/images/step-persona.png",
        "why": "Represent the user in discussions about the design in an elegant way. ",
        "how": "A persona can function as an archetype to represent a group of users that would use your product in a similar manner based on their shared features, characteristics, attitudes or goals. Based on research and insights from users, select an interesting segment of the user population and define a persona as a representation. Use insights from observations and interviews to depict a persona based on their needs, wants, expectations, goals, desire & habits, social background, and cultural &amp; demographic characteristics.",
        "ingredients": [
"User insights, preferably obtained through research.",
"A fictional and neutral name and photograph.",
"A rich description of the user based on your insights.",
"A willingness to avoid stereotypes in order to present the persona in a truthful and neutral manner."
],
        "in_practice": "Many design teams use personas. Some do not create their own personas by talking to end-users but borrow them from the net; however, much of the value of the persona is lost this way."
    },

    "customer-journey": {
        "type" : "card",
        "id": "customer-journey",
        "name": "Customer Journey",
        "strategy": "stepping-stone",
        "image": "/images/step-customer-journey.png",
        "why": "Visualize the user experience of a service over time and across the different interaction moments (touch points) within the service.",
        "how": "Divide the service into touch points: all points in which the user comes in contact with the company or service in any way. Visualize in a creative way how the user travels across the service, going through a ‘dramatic arc’ of positive and less positive experiences.",
        "ingredients": [
"A persona with a goal.",
"Representations of all touch points.",
"A blank customer journey map.",
"Creativity in creating a visually interesting version of the Customer Journey that fits a project."
],
        "in_practice": "Customer journeys are one of the basic stepping-stones in any service design project. "
    },

    "prototype": {
        "type" : "card",
        "id": "prototype",
        "name": "Prototype",
        "strategy": "stepping-stone",
        "image": "/images/step-prototype.png",
        "why": "Test an early model of your product with users, peers, experts or your client. Test goals can vary from testing the concept, to testing functionality, user experience, content breakdown, usability, or technical feasibility.",
        "how": "Decide which aspect of the design you want to prototype, what the audience of the prototype is (and what is would want) and on the fidelity. When a prototype is still conceptual and sketchy, it is called low-fidelity prototype. When more details are added, one speaks of a high-fidelity prototype. A large variety of prototypes exist; for example: paper prototype, demo, clickable prototype, video prototype, and provocative prototype.",
        "ingredients": [
"A clear goal or challenge for the prototype.",
"An open mind about experimenting with interactions, compositions, etc.",
"A sense of who the audience is and what needs to be communicated to them.",
"Knowledge of different types of prototype.",
"Prototyping materials or tools (paper, video, prototyping languages or toolsets)."
],
        "in_practice": "Prototypes are key in any project, but in particular in projects where it is uncertain how the user will interact with the system."
    },

    "inspiration-wall": {
        "type" : "card",
        "id": "inspiration-wall",
        "name": "Inspiration Wall",
        "strategy": "stepping-stone",
        "image": "/images/step-inspiration-wall.png",
        "why": "Save and organize creative ideas during a project, or even permanently, in order to have access to them very quickly and let ideas ‘simmer’ for a while.",
        "how": "Reserve a large physical space on a wall where you collect all the inspirational ideas for everyone to see and elaborate on. Try to find a place where lots of people pass, for example near the coffee machine. A digital inspiration wall is also possible with tools like Pinterest where you can invite people to share ideas on public as well as private pin boards.",
        "ingredients": [
"A wall that can easily be pinned, sticked and written upon.",
"Masking tape, pins, pens, post-it notes, brown paper, etc.",
"Digital pin boards like Pinterest.",
"Ideas, ideas, ideas..."
],
        "in_practice": "Most designers keep their own (private) inspiration walls (analogue or digital). Many high-end design firms like IDEO reserve flexible wall space to collect the inspiration related to a project."
    },

    "business-model-canvas": {
        "type" : "card",
        "id": "business-model-canvas",
        "name": "Business Model Canvas",
        "strategy": "stepping-stone",
        "image": "/images/step-business-model-canvas.png",
        "why": "Dream up in a structured and visual way, how a new company can reach its customers and make revenues in order to understand, discuss, create and analyse a business idea.",
        "how": "The business model canvas consists of several related aspects of a company. The canvas is a quick way to draft and improve a business plan. The key elements describe the market offer, infrastructure, customers, and finances.",
        "ingredients": [
"A business idea.",
"A printout of the canvas template.",
"A group of people discussing the contents.",
"A creative eye for new ways to do business and a critical eye for unrealistic plans."
],
        "in_practice": "The business model canvas is one of the exercises many start-ups go through when starting their business and again after a couple of years. It has served as inspiration for other fields that now also work with ‘canvasses’."
    },

    "requirement-list": {
        "type" : "card",
        "id": "requirement-list",
        "name": "Requirement List",
        "strategy": "stepping-stone",
        "image": "/images/step-requirements-list.png",
        "why": "To ensure your design meets all demands, a complete list of requirements can serve as a planning tool and checklist. ",
        "how": "Gather requirements by interviewing and studying (the context of) stakeholders. Determine if requirements are clear and complete. Possibly determine priorities together with stakeholders. Requirements lists could include requirements about: the user, design, context, architecture, technical aspects, performance, etc. Requirements can be written as a list, or in the form of user stories.",
        "ingredients": [
"An analytic view.",
"Knowing when to stop the requirement analysis and start sketching and prototyping.",
"The ability to write clear, unambiguous requirements."
],
        "in_practice": "Requirement lists are typical for large projects that use a waterfall type of development method and where the quality of outcome can be predetermined."
    },

    "risk-analysis": {
        "type" : "card",
        "id": "risk-analysis",
        "name": "Risk Analysis",
        "strategy": "stepping-stone",
        "image": "/images/step-risk-analysis.png",
        "why": "Determine which risks are acceptable by making an inventory of the possible threats in a project and determining the probability and impact of each threat. Possibly also determine the effect in, for example, terms of costs. ",
        "how": "Analyse the project together with a group of experienced people to identify possible threats. Check if safety regulations, laws, or standards are applicable in the context of the project. Beside threats you can also determine opportunities, for example when using a SWOT analysis (Strengths, Weaknesses, Opportunities, Threats).",
        "ingredients": [
"The ability to be extremely pessimistic.",
"A group of experienced people to help you.",
"A willingness and ability to see project-specific threats."
],
        "in_practice": "When the investments get bigger, a risk analysis becomes common practice. "
    },

    "task-analysis": {
        "type" : "card",
        "id": "task-analysis",
        "name": "Task Analysis",
        "strategy": "stepping-stone",
        "image": "/images/step-task-analysis.png",
        "why": "When your product has to support people performing some kind of task (for example repairing a car), a task analysis will help you and other designers understand the task better.",
        "how": "Use observations of and interviews of people performing a specific task. Try to determine if there are guidelines for the task. Determine which actions and cognitive processes take place. Analyse your findings to determine a task classification and outcomes, sequencing of tasks and sub-tasks.",
        "ingredients": [
"An interest to know details about jobs or tasks.",
"A modelling tool suitable for tasks and flows.",
"A suitable format, for example a swimming lane diagram.",
"A sense of task ‘hierarchy’."
],
        "in_practice": "Projects that deliver task specific software, such as in the military or (factory) control rooms, cannot do without task analysis."
    },

    "comparison-chart": {
        "type" : "card",
        "id": "comparison-chart",
        "name": "Comparison Chart",
        "strategy": "stepping-stone",
        "image": "/images/step-comparison-chart.png",
        "why": "A comparison chart, or comparison table, describes and compares attributes and characteristics of existing products or tools in order to determine the best option for your project.",
        "how": "Use desk research to find or compose a table containing information that compares  a number of products or tools. Be sure to determine the priority of the characteristics when making a choice.",
        "ingredients": [
"A list of attributes and characteristics that is important in the context of your project.",
"A list of products to compare, and information on these products.",
"A way to determine which attributes and characteristics are most important."
],
        "in_practice": "Comparison charts are often used in comparing and deciding on alternatives when buying (or subscribing to) software used for prototyping or development."
    },

    "test-report": {
        "type" : "card",
        "id": "test-report",
        "name": "Test Report",
        "strategy": "stepping-stone",
        "image": "/images/step-test-report.png",
        "why": "Describe test results, show the analysis of the results and conclude with lessons learned and recommendations. ",
        "how": "To ensure everybody is informed about the results of a (usability) test and to focus on further development, a test report is invaluable. Start by recalling the test goals. Then state all test results and analyse and prioritize them. Finally draw conclusions about what actions should be taken given the results.",
        "ingredients": [
"An ability to look critically at your own designs.",
"Test results can be positive or negative, be sure to state both.",
"A clear prioritization."
],
        "in_practice": "Test reports are a standard part of usability practice in bigger firms and usability consultancies."
    },

    "concept": {
        "type" : "card",
        "id": "concept",
        "name": "Concept",
        "strategy": "stepping-stone",
        "image": "/images/step-concept.png",
        "why": "When you develop a new product or service, the concept summarizes 'the big idea' or 'the main principle' on which your solution will be based. For example, most traditional churches have a floor plan based on a cross so God can recognize a church from the sky. Validate your concept(s) with stakeholders to determine desirability and feasibility. ",
        "how": "Usually several concepts are developed during the concept phase. Each concept should describe the whole, not a part. Your concepts can originate for example from ideation sessions, a requirement list or a USP. Describe the concept in a concise manner. A concept should at least describe which problem you are solving, for whom, using what means and what opportunity you are creating.",
        "ingredients": [
"Be sure to have equally attended concepts.",
"A quick and dirty prototyping approach to validate your concept.",
"Being able to choose a concept that is optimal for all stakeholders, instead of your personal preference."
],
        "in_practice": "In many projects where the solution doesn’t follow straightforwardly from the problem description, designers develop multiple concepts as an intermediate step."
    },

    "expert-review-report": {
        "type" : "card",
        "id": "expert-review-report",
        "name": "Expert Review Report",
        "strategy": "stepping-stone",
        "image": "/images/step-expert-review-report.png",
        "why": "In the early stages of design and open-ended projects, the opinion of experts can be used to give direction and focus to a project. The expert review report communicates the results of an expert review to all stakeholders.",
        "how": " Create a report consisting of who the experts were, how they were instructed to look at the product or idea, for example using heuristics, and what their opinions were. Include a meta review of your own stating what advise you find most pressing and how you intend to follow it up.",
        "ingredients": [
"A set of experts capable of looking beyond the current state of development.",
"Clear instruction for the experts, including guidelines, or methods of assessment and discussion.",
"The ability to handle, often conflicting, expert views."
],
        "in_practice": "Heuristic evaluation is a common type of expert review, often done before or to complement a usability test. Other expert reviews are also practiced, in particular in research projects."
    }
}